In [4]:
import pandas as pd
pd

In [5]:
filepath = "data files/data.xlsx"
df = pd.read_excel(filepath)

In [7]:
df.head()

      name  age   department  salary
0    Alice   30           HR   50000
1      Bob   24  Engineering   60000
2  Charlie   26        Sales   55000
3    David   35  Engineering   80000
4      Eve   29           HR   52000

In [9]:
df.tail(7)

      name  age   department  salary
4      Eve   29           HR   52000
5    Frank   27        Sales   58000
6    Grace   31  Engineering   70000
7   Hannah   23        Sales   53000
8      Ian   34           HR   51000
9     Jack   28  Engineering   62000
10     Eve   29           HR   52000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        11 non-null     object
 1   age         11 non-null     int64
 2   department  11 non-null     object
 3   salary      11 non-null     int64
dtypes: int64(2), object(2)
memory usage: 484.0+ bytes

In [11]:
df.shape

(11, 4)

In [12]:
df.columns

Index(['name', 'age', 'department', 'salary'], dtype='object')

In [13]:
df.describe()

             age        salary
count  11.000000     11.000000
mean   28.727273  58454.545455
std     3.744086   9299.071312
min    23.000000  50000.000000
25%    26.500000  52000.000000
50%    29.000000  55000.000000
75%    30.500000  61000.000000
max    35.000000  80000.000000

In [14]:
selected = df[['age','salary']]

In [15]:
selected

    age  salary
0    30   50000
1    24   60000
2    26   55000
3    35   80000
4    29   52000
5    27   58000
6    31   70000
7    23   53000
8    34   51000
9    28   62000
10   29   52000

In [16]:
df.iloc[5:8]

     name  age   department  salary
5   Frank   27        Sales   58000
6   Grace   31  Engineering   70000
7  Hannah   23        Sales   53000

In [19]:
df.sort_values(by = "salary"),

(       name  age   department  salary
 0     Alice   30           HR   50000
 8       Ian   34           HR   51000
 4       Eve   29           HR   52000
 10      Eve   29           HR   52000
 7    Hannah   23        Sales   53000
 2   Charlie   26        Sales   55000
 5     Frank   27        Sales   58000
 1       Bob   24  Engineering   60000
 9      Jack   28  Engineering   62000
 6     Grace   31  Engineering   70000
 3     David   35  Engineering   80000,)

In [25]:
df.sort_values(by = "age", ascending=False)

       name  age   department  salary
3     David   35  Engineering   80000
8       Ian   34           HR   51000
6     Grace   31  Engineering   70000
0     Alice   30           HR   50000
4       Eve   29           HR   52000
10      Eve   29           HR   52000
9      Jack   28  Engineering   62000
5     Frank   27        Sales   58000
2   Charlie   26        Sales   55000
1       Bob   24  Engineering   60000
7    Hannah   23        Sales   53000

In [26]:
df[df["age"] < 25]

     name  age   department  salary
1     Bob   24  Engineering   60000
7  Hannah   23        Sales   53000

In [27]:
df[df["salary"] <55000]

      name  age department  salary
0    Alice   30         HR   50000
4      Eve   29         HR   52000
7   Hannah   23      Sales   53000
8      Ian   34         HR   51000
10     Eve   29         HR   52000

In [63]:
df["location"]="kisumu"

In [46]:
df.loc[df["name"] == "Hannah","location"]='nairobi'